[
  { "code": "1A", "name": "American Light Lager", "impression": "A highly carbonated, very light-bodied, nearly flavorless lager designed to be consumed very cold. Very refreshing and thirst-quenching.", "guide": "2021 Beer" },
  { "code": "1B", "name": "American Lager", "impression": "A very pale, highly-carbonated, light-bodied, well-attenuated lager with a very neutral flavor profile and low bitterness. Served very cold, it can be a very refreshing and thirst-quenching drink.", "guide": "2021 Beer" },
  { "code": "1C", "name": "Cream Ale", "impression": "A clean, well-attenuated, highly carbonated, flavorful American “lawnmower” beer. Easily drinkable, smooth, and refreshing, with more character than typical American lagers, yet still subtle and restrained.", "guide": "2021 Beer" },
  { "code": "1D", "name": "American Wheat Beer", "impression": "A pale, refreshing grainy, doughy, or bready wheat beer with a clean fermentation profile and a variable hop character and bitterness. Its lighter body and higher carbonation contribute to its easy-drinking nature.", "guide": "2021 Beer" },
  { "code": "2A", "name": "International Pale Lager", "impression": "A highly-attenuated pale lager without strong flavors, typically well-balanced and highly carbonated. Served cold, it is refreshing and thirst-quenching.", "guide": "2021 Beer" },
  { "code": "2B", "name": "International Amber Lager", "impression": "A smooth, easily-drinkable, malty amber lager with a flavorful caramel or toast character. Usually fairly well-attenuated, often with an adjunct quality and restrained bitterness.", "guide": "2021 Beer" },
  { "code": "2C", "name": "International Dark Lager", "impression": "A darker, richer, and somewhat sweeter version of international pale lager with a little more body and flavor, but equally restrained in bitterness. The low bitterness leaves the malt as the primary flavor element, and the low hop levels provide very little in the way of balance.", "guide": "2021 Beer" },
  { "code": "3A", "name": "Czech Pale Lager", "impression": "A lighter-bodied, rich, refreshing, hoppy, bitter pale Czech lager having the familiar flavors of the stronger Czech Premium Pale Lager (Pilsner-type) beer but in a lower alcohol, lighter-bodied, and slightly less intense format.", "guide": "2021 Beer" },
  { "code": "3B", "name": "Czech Premium Pale Lager", "impression": "A refreshing pale Czech lager with considerable malt and hop character and a long finish. The malt flavors are complex for a Pilsner-type beer. The bitterness is strong and clean but lacks harshness, which gives a well-balanced, rounded flavor impression that enhances drinkability.", "guide": "2021 Beer" },
  { "code": "3C", "name": "Czech Amber Lager", "impression": "A malty amber Czech lager with a hop character that can vary from low to quite significant. The malt flavors also can vary, leading to different interpretations and balances ranging from drier, bready, and slightly biscuity to sweeter and somewhat caramel-like.", "guide": "2021 Beer" },
  { "code": "3D", "name": "Czech Dark Lager", "impression": "A rich, dark, malty Czech lager with a roast character that can vary from almost absent to quite prominent. Malty balance and an interesting and complex flavor profile, with variable levels of hopping that provides a range of possible interpretations.", "guide": "2021 Beer" },
  { "code": "4A", "name": "Munich Helles", "impression": "A gold-colored German lager with a smooth, malty flavor and a soft, dry finish. Subtle spicy, floral, or herbal hops and restrained bitterness help keep the balance malty but not sweet, which helps make this beer a refreshing, everyday drink.", "guide": "2021 Beer" },
  { "code": "4B", "name": "Festbier", "impression": "A smooth, clean, pale German lager with a moderately strong malty flavor and a light hop character. Deftly balances strength and drinkability, with a palate impression and finish that encourages drinking. Showcases elegant German malt flavors without becoming too heavy or filling.", "guide": "2021 Beer" },
  { "code": "4C", "name": "Helles Bock", "impression": "A relatively pale, strong, malty German lager with a nicely attenuated finish that enhances drinkability. The hop character is generally more apparent and the malt character less deeply rich than in other Bocks.", "guide": "2021 Beer" },
  { "code": "5A", "name": "German Leichtbier", "impression": "A pale, highly-attenuated, light-bodied German lager with lower alcohol and calories than standard-strength beers. Moderately bitter with noticeable malt and hop flavors, the beer is still interesting to drink.", "guide": "2021 Beer" },
  { "code": "5B", "name": "Kölsch", "impression": "A subtle, brilliantly clear, pale beer with a delicate balance of malt, fruit, and hop character, moderate bitterness, and a well-attenuated but soft finish. Freshness makes a huge difference with this beer, as the delicate character can fade quickly with age.", "guide": "2021 Beer" },
  { "code": "5C", "name": "German Helles Exportbier", "impression": "A golden German lager balancing a smooth malty profile with a bitter, hoppy character in a slightly above-average body and strength beer.", "guide": "2021 Beer" },
  { "code": "5D", "name": "German Pils", "impression": "A pale, dry, bitter German lager featuring a prominent hop aroma. Crisp, clean, and refreshing, showing a brilliant gold color with excellent head retention.", "guide": "2021 Beer" },
  { "code": "6A", "name": "Märzen", "impression": "An amber, malty German lager with a clean, rich, toasty, bready malt flavor, restrained bitterness, and a well-attenuated finish. The overall malt impression is soft, elegant, and complex, with a rich malty aftertaste that is never cloying or heavy.", "guide": "2021 Beer" },
  { "code": "6B", "name": "Rauchbier", "impression": "A beechwood-smoked, malty, amber German lager. The expected Märzen profile of toasty-rich malt, restrained bitterness, clean fermentation, and a relatively dry finish is enhanced by a noticeable to intense smoke character.", "guide": "2021 Beer" },
  { "code": "6C", "name": "Dunkles Bock", "impression": "A strong, dark, malty German lager beer that emphasizes the malty-rich and somewhat toasty qualities of continental malts without being sweet in the finish.", "guide": "2021 Beer" },
  { "code": "7A", "name": "Vienna Lager", "impression": "A moderate-strength continental amber lager with a soft, smooth maltiness and a balanced, moderate bitterness, yet finishing relatively dry. The malt flavor is clean, bready-rich, and somewhat toasty, with an elegant impression derived from quality base malts and process, not specialty malts or adjuncts.", "guide": "2021 Beer" },
  { "code": "7B", "name": "Altbier", "impression": "A moderately colored, well-attenuated, bitter beer with a rich maltiness balancing a strong bitterness. Light and spicy hop character complements the malt. A dry beer with a firm body and smooth palate.", "guide": "2021 Beer" },
  { "code": "8A", "name": "Munich Dunkel", "impression": "A traditional malty brown lager from Bavaria. Deeply toasted, bready malt flavors without any roasty or burnt flavors. Smooth and rich, with a restrained bitterness and a relatively dry finish that allows for drinking in quantity.", "guide": "2021 Beer" },
  { "code": "8B", "name": "Schwarzbier", "impression": "A dark German lager that balances roasted yet smooth malt flavors with moderate hop bitterness. The lighter body, dryness, and lack of a harsh, burnt, or heavy aftertaste helps make this beer quite drinkable.", "guide": "2021 Beer" },
  { "code": "9A", "name": "Doppelbock", "impression": "A strong, rich, and very malty German lager that can have both pale and dark variants. The darker versions have more richly-developed, deeper malt flavors, while the paler versions have slightly more hops and dryness.", "guide": "2021 Beer" },
  { "code": "9B", "name": "Eisbock", "impression": "A strong, full-bodied, rich, and malty dark German lager often with a viscous quality and strong flavors. Even though flavors are concentrated, the alcohol should be smooth and warming, not burning.", "guide": "2021 Beer" },
  { "code": "9C", "name": "Baltic Porter", "impression": "A strong, dark, malty beer with different interpretations within the Baltic region. Smooth, warming, and richly malty, with complex dark fruit flavors and a roasted flavor without burnt notes.", "guide": "2021 Beer" },
  { "code": "10A", "name": "Weissbier", "impression": "A pale, refreshing, lightly-hopped German wheat beer with high carbonation, dry finish, fluffy mouthfeel, and a distinctive banana-and-clove weizen yeast fermentation profile.", "guide": "2021 Beer" },
  { "code": "10B", "name": "Dunkles Weissbier", "impression": "A moderately dark German wheat beer with a distinctive banana-and-clove weizen yeast fermentation profile, supported by a toasted bread or caramel malt flavor. Highly carbonated and refreshing, with a creamy, fluffy texture and light finish.", "guide": "2021 Beer" },
  { "code": "10C", "name": "Weizenbock", "impression": "A strong and malty German wheat beer combining the best wheat and yeast flavors of a Weissbier with the rich maltiness, strength, and body of a Bock. The style range includes Bock and Doppelbock strength, with variations for pale and dark color.", "guide": "2021 Beer" },
  { "code": "11A", "name": "Ordinary Bitter", "impression": "Low gravity, alcohol, and carbonation make this an easy-drinking session beer. The malt profile can vary in flavor and intensity, but should never override the overall bitter impression. Drinkability is a critical component of the style.", "guide": "2021 Beer" },
  { "code": "11B", "name": "Best Bitter", "impression": "A flavorful, yet refreshing, session beer. Some examples can be more malt balanced, but this should not override the overall bitter impression. Drinkability is a critical component of the style.", "guide": "2021 Beer" },
  { "code": "11C", "name": "Strong Bitter", "impression": "An average-strength to moderately-strong British bitter ale. The balance may vary between fairly even between malt and hops to somewhat bitter. Drinkability is a critical component of the style. A rather broad style that allows for considerable interpretation by the brewer.", "guide": "2021 Beer" },
  { "code": "12A", "name": "British Golden Ale", "impression": "A hop-forward, average-strength to moderately-strong pale bitter. Drinkability and a refreshing quality are critical components of the style, as it was initially a summer seasonal beer.", "guide": "2021 Beer" },
  { "code": "12B", "name": "Australian Sparkling Ale", "impression": "A well-balanced, pale, highly-carbonated, and refreshing ale suitable for drinking in a hot climate. Fairly bitter, with a moderate herbal-spicy hop and pome fruit ester profile. Smooth, neutral malt flavors with a fuller body but a crisp, highly-attenuated finish.", "guide": "2021 Beer" },
  { "code": "12C", "name": "English IPA", "impression": "A bitter, moderately-strong, very well-attenuated pale British ale with a dry finish and a hoppy aroma and flavor. Classic British ingredients provide the most authentic flavor profile.", "guide": "2021 Beer" },
  { "code": "13A", "name": "Dark Mild", "impression": "A dark, low-gravity, malt-focused British session ale readily suited to drinking in quantity. Refreshing, yet flavorful for its strength, with a wide range of dark malt or dark sugar expression.", "guide": "2021 Beer" },
  { "code": "13B", "name": "British Brown Ale", "impression": "A malty, caramelly, brown British ale without the roasted flavors of a Porter. Balanced and flavorful, but usually a little stronger than most average UK beers.", "guide": "2021 Beer" },
  { "code": "13C", "name": "English Porter", "impression": "imply called “Porter” in Britain, the name “English Porter” is used to differentiate it from other derivative porters described in these guidelines.", "guide": "2021 Beer" },
  { "code": "14A", "name": "Scottish Light", "impression": "A low-alcohol, malty beer with light caramel, toast, toffee, and fruit flavors. A slight roast dryness offsets the residual sweetness in the finish, with the bitterness perceived only to keep the beer from being cloying.", "guide": "2021 Beer" },
  { "code": "14B", "name": "Scottish Heavy", "impression": "A lower-alcohol, malty beer with light caramel, toast, toffee, and fruity flavors. A slight roast dryness offsets the residual sweetness in the finish, with the bitterness perceived only to keep the beer from being cloying.", "guide": "2021 Beer" },
  { "code": "14C", "name": "Scottish Export", "impression": "A moderate-strength, malty beer with light caramel, toast, toffee, and fruit flavors. A slight roast dryness offsets the residual sweetness in the finish, with the bitterness perceived only to keep the beer from being cloying", "guide": "2021 Beer" },
  { "code": "15A", "name": "Irish Red Ale", "impression": "An easy-drinking pint, often with subtle flavors. Slightly malty in the balance sometimes with an initial soft toffee or caramel sweetness, a slightly grainy-biscuity palate, and a touch of roasted dryness in the finish. Some versions can emphasize the caramel and sweetness more, while others will favor the grainy palate and roasted dryness.", "guide": "2021 Beer" },
  { "code": "15B", "name": "Irish Stout", "impression": "A black beer with a pronounced roasted flavor, often similar to coffee. The balance can range from fairly even to quite bitter, with the more balanced versions having a little malty sweetness and the bitter versions being quite dry. Draught versions typically are creamy from a nitro pour, but bottled versions will not have this dispense-derived character.", "guide": "2021 Beer" },
  { "code": "15C", "name": "Irish Extra Stout", "impression": "A fuller-bodied black beer with a pronounced roasted flavor, often similar to coffee and dark chocolate with some malty complexity. The balance can range from moderately bittersweet to bitter, with the more balanced versions having up to moderate malty richness and the bitter versions being quite dry.", "guide": "2021 Beer" },
  { "code": "16A", "name": "Sweet Stout", "impression": "A very dark, sweet, full-bodied, slightly roasty stout that can suggest coffee-and-cream, or sweetened espresso.", "guide": "2021 Beer" },
  { "code": "16B", "name": "Oatmeal Stout", "impression": "A dark, roasty, full-bodied stout with enough sweetness to support the oat backbone. The sweetness, balance, and oatmeal impression can vary considerably.", "guide": "2021 Beer" },
  { "code": "16C", "name": "Tropical Stout", "impression": "A very dark, sweet, fruity, moderately strong stout with smooth, roasty flavors, yet no burnt harshness.", "guide": "2021 Beer" },
  { "code": "16D", "name": "Foreign Extra Stout", "impression": "A very dark, rich, moderately strong, fairly dry stout with prominent roast flavors.", "guide": "2021 Beer" },
  { "code": "17A", "name": "British Strong Ale", "impression": "An ale of respectable alcoholic strength, traditionally bottled-conditioned and cellared. Can have a wide range of interpretations, but most will have varying degrees of malty richness, late hops and bitterness, fruity esters, and alcohol warmth. The malt and adjunct flavors and intensity can vary widely, but any combination should result in an agreeable palate experience.", "guide": "2021 Beer" },
  { "code": "17B", "name": "Old Ale", "impression": "A stronger-than-average English ale, though usually not as strong or rich as an English Barley Wine, but usually malty. Warming. Shows positive maturation effects of a well-kept, aged beer.", "guide": "2021 Beer" },
  { "code": "17C", "name": "Wee Heavy", "impression": "Rich, sweet malt depth with caramel, toffee, and fruity flavors. Full-bodied and chewy, with warming alcohol. Restrained bitterness, but not cloying or syrupy.", "guide": "2021 Beer" },
  { "code": "17D", "name": "English Barleywine", "impression": "A strong and richly malty ale with a pleasant fruity or hoppy depth. A wintertime sipper with a full, chewy body and warming alcohol.", "guide": "2021 Beer" },
  { "code": "18A", "name": "Blonde Ale", "impression": "Easy-drinking, approachable, malt-oriented American craft beer, often with interesting fruit, hop, or character malt notes. Well-balanced and clean, is a refreshing pint without aggressive flavors.", "guide": "2021 Beer" },
  { "code": "18B", "name": "American Pale Ale", "impression": "An average-strength, hop-forward, pale American craft beer with sufficient supporting malt to make the beer balanced and drinkable. The clean hop presence can reflect classic or modern American or New World hop varieties with a wide range of characteristics.", "guide": "2021 Beer" },
  { "code": "19A", "name": "American Amber Ale", "impression": "An amber, hoppy, moderate-strength American craft beer with a malty caramel flavor. The balance can vary quite a bit, with some versions being fairly malty and others being aggressively hoppy. Hoppy and bitter versions should not have clashing flavors with the caramel malt profile.", "guide": "2021 Beer" },
  { "code": "19B", "name": "California Common", "impression": "A toasty and caramelly, fairly bitter, standard-strength beer with an interesting fruitiness and rustic, woody hop character. Smooth and well carbonated.", "guide": "2021 Beer" },
  { "code": "19C", "name": "American Brown Ale", "impression": "A malty but hoppy standard-strength American ale frequently with chocolate and caramel flavors. The hop flavor and aroma complement and enhance the malt rather than clashing with it.", "guide": "2021 Beer" },
  { "code": "20A", "name": "American Porter", "impression": "A malty, bitter, and often somewhat hoppy dark beer with a balanced, roasted, and frequently chocolatey character.", "guide": "2021 Beer" },
  { "code": "20B", "name": "American Stout", "impression": "A fairly strong, highly roasted, bitter, hoppy dark stout. The body and dark flavors typical of stouts with a more aggressive American hop character and bitterness.", "guide": "2021 Beer" },
  { "code": "20C", "name": "Imperial Stout", "impression": "An intensely-flavored, very strong, very dark stout with a broad range of interpretations. Roasty-burnt malt with a depth of dark or dried fruit flavors, and a warming, bittersweet finish. Despite the intense flavors, the components need to meld together to create a complex, harmonious beer, not a hot mess – sometimes only accomplished with age.", "guide": "2021 Beer" },
  { "code": "21A", "name": "American IPA", "impression": "A decidedly hoppy and bitter, moderately strong, pale American ale. The balance is hop-forward, with a clean fermentation profile, dryish finish, and clean, supporting malt allowing a creative range of hop character to shine through.", "guide": "2021 Beer" },
  { "code": "21B", "name": "Specialty IPA: Belgian IPA", "impression": "A dry, hoppy IPA with fruitiness and spiciness of Belgian yeast. Often lighter in color and more attenuated, similar to a Belgian Tripel that has been brewed with more hops.", "guide": "2021 Beer" },
  { "code": "21B", "name": "Specialty IPA: Black IPA", "impression": "A beer with the dryness, hop-forward balance, and flavor characteristics of an American IPA, but darker in color. Darker malts add a gentle and supportive flavor, not a strongly roasted or burnt character.", "guide": "2021 Beer" },
  { "code": "21B", "name": "Specialty IPA: Brown IPA", "impression": "Hoppy, bitter, and moderately strong like an American IPA, but with dark caramel, chocolate, toffee, or dark fruit character as in an American Brown Ale. Retaining the dryish finish and lean body that makes IPAs so drinkable, a Brown IPA is a little more flavorful and malty than an American IPA without being sweet or heavy.", "guide": "2021 Beer" },
  { "code": "21B", "name": "Specialty IPA: Brut IPA", "impression": "A very pale, hop-forward American IPA variant with a bone-dry finish, very high carbonation, and a restrained bitterness level. Can be suggestive of a sparkling white wine or Champagne. The hop character is modern, and emphasizes flavor and aroma dimensions.", "guide": "2021 Beer" },
  { "code": "21B", "name": "Specialty IPA: Red IPA", "impression": "Hoppy, bitter, and moderately strong like an American IPA, but with some caramel, toffee, or fruit character as in an American Amber Ale. Retaining the dryish finish and lean body that makes IPAs so drinkable, a Red IPA is a little more flavorful and malty than an American IPA without being sweet or heavy.", "guide": "2021 Beer" },
  { "code": "21B", "name": "Specialty IPA: Rye IPA", "impression": "An American IPA with spicy, grainy rye malt. The rye gives a bready and peppery flavor, a creamier body, and a dry, grainy finish.", "guide": "2021 Beer" },
  { "code": "21B", "name": "Specialty IPA: White IPA", "impression": "A fruity, spicy, refreshing version of an American IPA, but with a lighter color, less body, and featuring the distinctive yeast or spice additions typical of a Witbier.", "guide": "2021 Beer" },
  { "code": "21B", "name": "Specialty IPA: Session IPA", "impression": "PLACEHOLDER", "guide": "2021 Beer" },
  { "code": "21C", "name": "Hazy IPA", "impression": "An American IPA with intense fruit flavors and aromas, a soft body, smooth mouthfeel, and often opaque with substantial haze. Less perceived bitterness than traditional IPAs but always massively hop-forward.", "guide": "2021 Beer" },
  { "code": "22A", "name": "Double IPA", "impression": "An intensely hoppy, fairly strong, bitter pale ale without the big, rich, complex maltiness, residual sweetness, and body of an American Barleywine. Strongly hopped, but clean, dry, and lacking harshness. Despite showing its strength, drinkability is an important consideration.", "guide": "2021 Beer" },
  { "code": "22B", "name": "American Strong Ale", "impression": "A malty, bitter, and strong American Ale fitting in the space between American Barleywine, Double IPA, and Red IPA. The malty and hoppy flavors can be quite strong, but are generally in balance.", "guide": "2021 Beer" },
  { "code": "22C", "name": "American Barleywine", "impression": "A very strong, malty, hoppy, bitter American ale with a rich palate, full mouthfeel, and warming aftertaste, suitable for contemplative sipping.", "guide": "2021 Beer" },
  { "code": "22D", "name": "Wheatwine", "impression": "A richly textured, high alcohol sipping beer with a significant grainy, bready flavor, and a sleek body. The emphasis is first on the bready, wheaty flavors with malt, hops, fruity yeast, and alcohol complexity.", "guide": "2021 Beer" },
  { "code": "23A", "name": "Berliner Weisse", "impression": "A very pale, refreshing, low-alcohol German wheat beer with a clean lactic sourness and a very high carbonation level. A light bread dough malt flavor supports the sourness, which shouldn’t seem artificial. A gentle fruitiness is found in the best examples.", "guide": "2021 Beer" },
  { "code": "23B", "name": "Flanders Red Ale", "impression": "A sour and fruity oak-aged reddish-brown Belgian-style ale with supportive toasty malt flavors and fruit complexity. The dry, tannic finish supports the suggestion of a vintage red wine.", "guide": "2021 Beer" },
  { "code": "23C", "name": "Oud Bruin", "impression": "A malty, fruity, aged, somewhat sour Belgian-style brown ale with a caramel-chocolate malt flavor, and often substantial alcohol.", "guide": "2021 Beer" },
  { "code": "23D", "name": "Lambic", "impression": "A fairly sour, often moderately funky, wild Belgian wheat beer with sourness taking the place of hop bitterness in the balance. Traditionally served uncarbonated as a café drink.", "guide": "2021 Beer" },
  { "code": "23E", "name": "Gueuze", "impression": "A very refreshing, highly carbonated, pleasantly sour but balanced wild Belgian wheat beer. The wild beer character can be complex and varied, combining sour, funky, and fruity flavors.", "guide": "2021 Beer" },
  { "code": "23F", "name": "Fruit Lambic", "impression": "A complex, refreshing, pleasantly sour Belgian wheat beer blending a complementary fermented fruit character with a sour, funky Gueuze.", "guide": "2021 Beer" },
  { "code": "23G", "name": "Gose", "impression": "A tart, lightly-bittered historical central European wheat beer with a distinctive but restrained salt and coriander character. Very refreshing, with a dry finish, high carbonation, and bright flavors.", "guide": "2021 Beer" },
  { "code": "24A", "name": "Witbier", "impression": "A pale, hazy Belgian wheat beer with spices accentuating the yeast character. A delicate, lightly spiced, moderate-strength ale that is a refreshing summer drink with its high carbonation, dry finish, and light hopping.", "guide": "2021 Beer" },
  { "code": "24B", "name": "Belgian Pale Ale", "impression": "A top-fermented, all malt, average strength Belgian ale that is moderately bitter, not dry-hopped, and without strong flavors. The copper-colored beer lacks the aggressive yeast character or sourness of many Belgian beers, but has a well-balanced, malty, fruity, and often bready and toasty profile.", "guide": "2021 Beer" },
  { "code": "24C", "name": "Bière de Garde", "impression": "A family of smooth, fairly strong, malty, lagered artisanal French beer with a range of malt flavors appropriate for the blond, amber, or brown color. All are malty yet dry, with clean flavors. Darker versions have more malt character, while paler versions can have more hops while still remaining malt-focused beers.", "guide": "2021 Beer" },
  { "code": "25A", "name": "Belgian Blond Ale", "impression": "A golden, moderately-strong Belgian ale with a pleasantly subtle citrusy-spicy yeast complexity, smooth malty palate, and dry, soft finish.", "guide": "2021 Beer" },
  { "code": "25B", "name": "Saison", "impression": "A family of refreshing, highly attenuated, hoppy, and fairly bitter Belgian ales with a very dry finish and high carbonation. Characterized by a fruity, spicy, sometimes phenolic fermentation profile, and the use of cereal grains and sometimes spices for complexity. Several variations in strength and color exist.", "guide": "2021 Beer" },
  { "code": "25C", "name": "Belgian Golden Strong Ale", "impression": "A very pale, highly attenuated, strong Belgian ale that is more fruity and hoppy than spicy. Complex and delicate, the dry finish, light body, and high carbonation accentuate the yeast and hop character. Sparkling carbonation and effervescent, forming a rocky white head.", "guide": "2021 Beer" },
  { "code": "26A", "name": "Belgian Single", "impression": "A blond, bitter, hoppy table beer that is very dry and highly carbonated. The aggressive fruity-spicy Belgian yeast character and high bitterness is forward in the balance, with a soft, supportive grainy-sweet malt palate, and a spicy-floral hop profile.", "guide": "2021 Beer" },
  { "code": "26B", "name": "Belgian Dubbel", "impression": "A deep reddish-copper, moderately strong, malty, complex Belgian ale with rich malty flavors, dark or dried fruit esters, and light alcohol blended together in a malty presentation that still finishes fairly dry.", "guide": "2021 Beer" },
  { "code": "26C", "name": "Belgian Tripel", "impression": "A strong, pale, somewhat spicy Belgian ale with a pleasant rounded malt flavor, firm bitterness, and dry finish. Quite aromatic, with spicy, fruity, and light alcohol notes combining with the supportive clean malt character to produce a surprisingly drinkable beverage considering the high alcohol content.", "guide": "2021 Beer" },
  { "code": "26D", "name": "Belgian Dark Strong Ale", "impression": "A dark, complex, very strong Belgian ale with a delicious blend of malt richness, dark fruit flavors, and spicy notes. Complex, rich, smooth, and dangerous.", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: Kellerbier", "impression": "An unfiltered, unpasteurized, fully-attenuated German lager traditionally served from lagering vessels. May be a little richer, more robust, and rustic than the base styles. A fresh beer without fermentation defects associated with young, green (unfinished) beer.", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: Kentucky Common", "impression": "A clean, dry, refreshing, slightly malty dark beer with high carbonation. Mild-tasting, with light toast and caramel flavors, served very fresh as a sessionable saloon beer.", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: Lichtenhainer", "impression": "A sour, smoked, lower-gravity historical central European wheat beer. Complex yet refreshing character due to high attenuation and carbonation, along with low bitterness and moderate sourness.", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: London Brown Ale", "impression": "A luscious, sweet, malty, low-alcohol dark brown ale, with caramel and toffee malt complexity and a sweet-tasting finish.", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: Piwo Grodziskie", "impression": "A low-gravity, bitter, oak-smoked historical central European wheat beer with a clean fermentation profile and no sourness. Highly carbonated, dry, crisp, and refreshing.", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: Pre-Prohibition Lager", "impression": "A bitter and hoppy pale American adjunct lager, often with a robust, corny flavor profile, although more crisp and neutral-tasting versions exist.", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: Pre-Prohibition Porter", "impression": "A historical American adaptation of English Porter by German immigrants using American ingredients, including adjuncts.", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: Roggenbier", "impression": "A Dunkles Weissbier made with rye rather than wheat, but with a greater body and light finishing hops. The rye gives a bready and peppery flavor, a creamy body, and a dry, grainy finish that blends with the distinctive banana-and-clove weizen yeast character", "guide": "2021 Beer" },
  { "code": "27", "name": "Historical Beer: Sahti", "impression": "A sweet, heavy, strong traditional Finnish farmhouse beer usually with rye and juniper, and a banana-clove yeast character.", "guide": "2021 Beer" },
  { "code": "28A", "name": "Brett Beer", "impression": "Most often drier and fruitier than the base style suggests. Fruity or funky notes range from low to high, depending on the age of the beer and strains of Brett used. May possess a light non-lactic acidity.", "guide": "2021 Beer" },
  { "code": "28B", "name": "Mixed-Fermentation Sour Beer", "impression": "A sour and funky version of a base style of beer.", "guide": "2021 Beer" },
  { "code": "28C", "name": "Wild Specialty Beer", "impression": "An American Wild Ale with fruit, herbs, spices, or other Specialty-Type Ingredients.", "guide": "2021 Beer" },
  { "code": "28D", "name": "Straight Sour Beer", "impression": "A pale, refreshing, sour beer with a clean lactic sourness. A gentle, pale malt flavor supports the lemony sourness with moderate fruity esters.", "guide": "2021 Beer" },
  { "code": "29A", "name": "Fruit Beer", "impression": "A pleasant integration of fruit with beer, but still recognizable as beer. The fruit character should be evident but in balance with the beer, not so forward as to suggest an artificial product.", "guide": "2021 Beer" },
  { "code": "29B", "name": "Fruit and Spice Beer", "impression": "A tasteful union of fruit, spice, and beer, but still recognizable as beer. The fruit and spice character should each be evident but in balance with the beer, not so forward as to suggest an artificial product.", "guide": "2021 Beer" },
  { "code": "29C", "name": "Specialty Fruit Beer", "impression": "A appealing combination of fruit, sugar, and beer, but still recognizable as a beer. The fruit and sugar character should both be evident but in balance with the beer, not so forward as to suggest an artificial product.", "guide": "2021 Beer" },
  { "code": "29D", "name": "Grape Ale", "impression": "Combines the profile of a sparkling wine and a relatively neutral base beer allowing the aromatic qualities of the grape to blend pleasantly with hop and yeast aromatics. Can be in a range from refreshing to complex.", "guide": "2021 Beer" },
  { "code": "30A", "name": "Spice, Herb, or Vegetable Beer", "impression": "An appealing fusion of spices, herbs, or vegetables (SHVs) and beer, but still recognizable as beer. The SHV character should be evident but in balance with the beer, not so forward as to suggest an artificial product.", "guide": "2021 Beer" },
  { "code": "30B", "name": "Autumn Seasonal Beer", "impression": "A malty, spiced beer that often has a moderately rich body and slightly warming finish suggesting a good accompaniment for the cool fall season, and often evocative of harvest or Thanksgiving traditions.", "guide": "2021 Beer" },
  { "code": "30C", "name": "Winter Seasonal Beer", "impression": "A stronger, darker, spiced beer that often has a rich body and warming finish suggesting a good accompaniment for the cold winter season.", "guide": "2021 Beer" },
  { "code": "30D", "name": "Specialty Spice Beer", "impression": "An appealing combination of spices, herbs, or vegetables (SHVs), sugars, and beer, but still recognizable as beer. The SHV and sugar character should both be evident but in balance with the beer, not so forward as to suggest an artificial product.", "guide": "2021 Beer" },
  { "code": "31A", "name": "Alternative Grain Beer", "impression": "A base beer enhanced by or featuring the character of additional grains. The specific character depends greatly on the added grains.", "guide": "2021 Beer" },
  { "code": "31B", "name": "Alternative Sugar Beer", "impression": "A tasteful integration of sugar and beer, but still recognizable as beer. The sugar character should both be evident and in balance with the beer, not so forward as to suggest an artificial product.", "guide": "2021 Beer" },
  { "code": "32A", "name": "Classic Style Smoked Beer", "impression": "A well-balanced fusion of the malt and hops of the base beer style with a pleasant and agreeable smoke character.", "guide": "2021 Beer" },
  { "code": "32B", "name": "Specialty Smoked Beer", "impression": "A well-balanced fusion of the malt and hops of the base specialty beer style with a pleasant and agreeable smoke character.", "guide": "2021 Beer" },
  { "code": "33A", "name": "Wood-Aged Beer", "impression": "A pleasant enhancement of the base beer style with the characteristics from aging in contact with wood. The best examples will be smooth, flavorful, well-balanced, and well-aged.", "guide": "2021 Beer" },
  { "code": "33B", "name": "Specialty Wood-Aged Beer", "impression": "An elevation of the base beer style with characteristics from aging in contact with wood, including alcoholic products previously in contact with the wood. The best examples will be smooth, flavorful, well-balanced, and well-aged.", "guide": "2021 Beer" },
  { "code": "34A", "name": "Commercial Specialty Beer", "impression": "Based on declared beer.", "guide": "2021 Beer" },
  { "code": "34B", "name": "Mixed-Style Beer", "impression": "Based on the declared Base Styles, methods, and ingredients. As with all Specialty-Type Beers, the resulting combination of beer styles needs to be harmonious and balanced, and be pleasant to drink.", "guide": "2021 Beer" },
  { "code": "34C", "name": "Experimental Beer", "impression": "Varies, but should be a unique experience.", "guide": "2021 Beer" },
  { "code": "M1A", "name": "Dry Mead", "impression": "Similar in balance, body, finish and flavor intensity to a dry white wine, with a pleasant mixture of subtle honey character, soft fruity esters, and clean alcohol. Complexity, harmony, and balance of sensory elements are most desirable, with no inconsistencies in color, aroma, flavor or aftertaste. The proper balance of sweetness, acidity, alcohol, and honey character is the essential final measure of any mead.", "guide": "2015 Mead" },
  { "code": "M1B", "name": "Semi-Sweet Mead", "impression": "Similar in balance, body, finish and flavor intensity to a semi-sweet (or medium-dry) white wine, with a pleasant mixture of honey character, light sweetness, soft fruity esters, and clean alcohol. Complexity, harmony, and balance of sensory elements are most desirable, with no inconsistencies in color, aroma, flavor or aftertaste. The proper balance of sweetness, acidity, alcohol, and honey character is the essential final measure of any mead.", "guide": "2015 Mead" },
  { "code": "M1C", "name": "Sweet Mead", "impression": "Similar in balance, body, finish and flavor intensity to a well-made dessert wine (such as Sauternes), with a pleasant mixture of honey character, residual sweetness, soft fruity esters, and clean alcohol. Complexity, harmony, and balance of sensory elements are most desirable, with no inconsistencies in color, aroma, flavor or aftertaste. The proper balance of sweetness, acidity, alcohol, and honey character is the essential final measure of any mead.", "guide": "2015 Mead" },
  { "code": "M2A", "name": "Cyser", "impression": "In well-made examples of the style, the fruit is both distinctive and well-incorporated into the honey-sweet-acid-tannin-alcohol balance of the mead. Some of the best strong examples have the taste and aroma of an aged Calvados (apple brandy from northern France), while subtle, dry versions can taste similar to many fine white wines. There should be an appealing blend of the fruit and honey character but not necessarily an even balance. Generally a good tannin-sweetness balance is desired, though very dry and very sweet examples do exist.", "guide": "2015 Mead" },
  { "code": "M2B", "name": "Pyment", "impression": "In well-made examples of the style, the grape is both distinctively vinous and well-incorporated into the honey-sweet-acid-tannin-alcohol balance of the mead. White and red versions can be quite different, and the overall impression should be characteristic of the type of grapes used and suggestive of a similar variety wine. There should be an appealing blend of the fruit and honey character but not necessarily an even balance. Generally a good tannin-sweetness balance is desired, though very dry and very sweet examples do exist.", "guide": "2015 Mead" },
  { "code": "M2C", "name": "Berry Mead", "impression": "In well-made examples of the style, the fruit is both distinctive and well-incorporated into the honey-sweet-acid-tannin-alcohol balance of the mead. Different types of fruit can result in widely different characteristics; allow for a variation in the final product.", "guide": "2015 Mead" },
  { "code": "M2D", "name": "Stone Fruit Mead", "impression": "In well-made examples of the style, the fruit is both distinctive and well-incorporated into the honey-sweet-acid-tannin-alcohol balance of the mead. Different types of fruit can result in widely different characteristics; allow for a variation in the final product.", "guide": "2015 Mead" },
  { "code": "M2E", "name": "Melomel", "impression": "In well-made examples of the style, the fruit is both distinctive and well-incorporated into the honey-sweet-acid-tannin-alcohol balance of the mead. Different types of fruit can result in widely different characteristics; allow for a variation in the final product.", "guide": "2015 Mead" },
  { "code": "M3A", "name": "Fruit and Spice Mead", "impression": "In well-made examples of the style, the fruits and spices are both distinctive and well-incorporated into the honey-sweet-acid-tannin-alcohol balance of the mead. Different types of fruits and spices can result in widely different characteristics; allow for significant variation in the final product.", "guide": "2015 Mead" },
  { "code": "M3B", "name": "Spice, Herb or Vegetable Mead", "impression": "In well-made examples of the style, the spices are both distinctive and well-incorporated into the honey-sweet-acid-tannin-alcohol balance of the mead. Different types of spices can result in widely different characteristics; allow for a variation in the final product.", "guide": "2015 Mead" },
  { "code": "M4A", "name": "Braggot", "impression": "A harmonious blend of mead and beer, with the distinctive characteristics of both. A wide range of results are possible, depending on the base style of beer, variety of honey and overall sweetness and strength. Beer flavors tend to somewhat mask typical honey flavors found in other meads.", "guide": "2015 Mead" },
  { "code": "M4B", "name": "Historical Mead", "impression": "This mead should exhibit the character of all of the ingredients in varying degrees, and should show a good blending or balance between the various flavor elements. Whatever ingredients are included, the result should be identifiable as a honey-based fermented beverage.", "guide": "2015 Mead" },
  { "code": "M4C", "name": "Experimental Mead", "impression": "This mead should exhibit the character of all of the ingredients in varying degrees, and should show a good blending or balance between the various flavor elements. Whatever ingredients are included, the result should be identifiable as a honey-based fermented beverage.", "guide": "2015 Mead" },
  { "code": "C1A", "name": "Common Cider", "impression": "A refreshing drink with the fruity and floral aroma of apples, and a bright, juicy acidity. Fresh, with a clean fermentation, but possibly showing a slight yeast character.", "guide": "2025 Cider" },
  { "code": "C1B", "name": "Heirloom Cider", "impression": "Combining the apple character and acidity of a Common Cider with the tannin of an English or French Cider, while retaining a clean fermentation profile.", "guide": "2025 Cider" },
  { "code": "C1C", "name": "English Cider", "impression": "Full-bodied and often seeming quite dry with a long finish from high tannin content. The fruit expression may seem subtle due to a lower estery apple character than most styles, but the fruit-derived flavor profile can be complex but non-fruity. Can optionally have a phenolic, smoky, or light barnyard MLF complexity.", "guide": "2025 Cider" },
  { "code": "C1D", "name": "French Cider", "impression": "Medium to sweet, full-bodied, rich. Somewhat fruity. May have a background level of phenolic, smoky, or farmyard character.", "guide": "2025 Cider" },
  { "code": "C1E", "name": "Spanish Cider", "impression": "Dry and fresh, with a bright acidity that may contain light to moderate acetic and wild notes. Rustic and earthy impression, traditionally unfiltered.", "guide": "2025 Cider" },
  { "code": "C2A", "name": "New England Cider", "impression": "Substantial body and character. Typically is relatively dry, but can be somewhat sweet if in balance and not containing hot alcohol. Sometimes has a barrel character. Often has flavors from adjuncts, especially raisins.", "guide": "2025 Cider" },
  { "code": "C2B", "name": "Applewine", "impression": "Typically presents like a dry white wine, with fruity and floral notes. Balanced, with low astringency and bitterness. Alcohol is typically noticeable.", "guide": "2025 Cider" },
  { "code": "C2C", "name": "Ice Cider", "impression": "Fruity, with a depth and complexity of apple flavor. Smooth, rich, sweet, and dessert wine-like but with a balancing acidity, like in a Sauternes or other high-quality dessert wine.", "guide": "2025 Cider" },
  { "code": "C2D", "name": "Fire Cider", "impression": "A dark gold to brown cider with a very sweet, caramelized, maple sugar-like impression. Well-aged versions often exhibit a dark fruit or sherry-like character.", "guide": "2025 Cider" },
  { "code": "C3A", "name": "Fruit Cider", "impression": "A pleasant integration of cider and added fruit. The apple character and the added fruit must be noticeable, balanced, and complementary. If a base style is declared, should show some evidence of that style. If no base style is declared, assume to be a Common Cider.", "guide": "2025 Cider" },
  { "code": "C3B", "name": "Spiced Cider", "impression": "A pleasant integration of cider and added spices. The apple character must combine with the botanicals to give a balanced result. If a base style is declared, should show some evidence of that style.", "guide": "2025 Cider" },
  { "code": "C3C", "name": "Experimental Cider", "impression": "Overall balance and drinkability are the critical success factors for this style. The resulting cider should contain recognizable experimental components, and be pleasant to drink.", "guide": "2025 Cider" },
  { "code": "C4A", "name": "Common Perry", "impression": "Mildly fruity, fuller-bodied. Usually semi-dry to semi-sweet. Still to pétillant, typically. Only very slight acetification is acceptable.", "guide": "2025 Cider" },
  { "code": "C4B", "name": "Heirloom Perry", "impression": "Tannic and somewhat fruity, with a fuller body. English examples tend to be drier than French examples, so the sweetness level is variable. English and French examples may be carbonated to higher levels.", "guide": "2025 Cider" },
  { "code": "C4C", "name": "Ice Perry", "impression": "Full-bodied, bright, and fruity, with a balanced acidity. Sweet, but not cloying. Still to pétillant.", "guide": "2025 Cider" },
  { "code": "C4D", "name": "Experimental Perry", "impression": "Overall balance and drinkability are the critical success factors for this style. The resulting perry should contain recognizable experimental components, and be pleasant to drink.", "guide": "2025 Cider" }
]
